InformationRegisters/ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостоянияСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторныхПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОбмена(Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.ИдентификаторЗаявки КАК ИдентификаторЗаявки,
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.ТекстЗапроса КАК ТекстЗапроса,
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.ТекстОтвета КАК ТекстОтвета,
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.Статус КАК Статус,
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.ОшибкиВыполнения КАК ОшибкиВыполнения,
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.КодСостоянияСервера КАК КодСостоянияСервера
		|ИЗ
		|	РегистрСведений.ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала КАК ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала
		|ГДЕ
		|	ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекстЗапроса = Выборка.ТекстЗапроса.Получить();
	ТекстОтвета  = Выборка.ТекстОтвета.Получить();
	
	ДанныеОбмена = Новый Структура;
	ДанныеОбмена.Вставить("ИдентификаторЗаявки", Выборка.ИдентификаторЗаявки);
	ДанныеОбмена.Вставить("СтатусЗаявки", Выборка.Статус);
	ДанныеОбмена.Вставить("ТекстОшибки", Выборка.ОшибкиВыполнения);
	ДанныеОбмена.Вставить("КодСостоянияСервера", Выборка.КодСостоянияСервера);
	ДанныеОбмена.Вставить("ТекстЗапросаФормированияЗаявки", ТекстЗапроса);
	ДанныеОбмена.Вставить("ТекстОтветаПолучениеРезультата", ТекстОтвета);
	
	Возврат ДанныеОбмена;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОбмена = ПолучитьДанныеОбмена(ТекущиеДанные.Идентификатор);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	ОткрытьФорму("Обработка.ИнформацияОбработкиЗапроса.Форма.Форма", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти
